layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: {
      dim: 64
      dim: 3
      dim: 32
      dim: 32
      }
  }
}
layer {
  name: "labels"
  type: "Input"
  top: "labels"
  input_param {
    shape: {
      dim: 64
      dim: 1
      dim: 1
      dim: 1
      }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 5
    num_output: 32
    stride: 1
    pad: 0
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv1-relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3 # pool over a 3x3 region
    stride: 2      # step two pixels (in the bottom blob) between pooling regions
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 5
    num_output: 64
    stride: 1
    pad: 2
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv2-relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3 # pool over a 3x3 region
    stride: 2      # step two pixels (in the bottom blob) between pooling regions
  }
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 2,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 3
    num_output: 64
    stride: 1
    pad: 1
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv3-relu"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 2,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 3
    num_output: 64
    stride: 1
    pad: 1
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv4-relu"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv4"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3 # pool over a 3x3 region
    stride: 2      # step two pixels (in the bottom blob) between pooling regions
  }
}

layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}

  inner_product_param {
    num_output: 128

    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc6-relu"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name:  "fc6_drop"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"

  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}

  inner_product_param {
    num_output: 128

    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc7-relu"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name:  "fc7_drop"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"

  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}

  inner_product_param {
    num_output: 10

    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "acc"
  top: "acc"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "labels"
}
layer {
  name: "loss"
  top: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "labels"
  loss_param{
    ignore_label: 42424242
  }
  loss_weight: 1
}

